#include <stdio.h>
int main()
{
	//一维数组
	int a[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 0}; //定义一个数组a，含10个元素
	//int a[ ]={1,2,3,4,5,6,7,8,9,0};相当于int a[10]={1,2,3,4,5,6,7,8,9,0};
	printf("%d,%d,%d\n", a[2], a[5], a[9]); //引用

	printf("…………………………\n");
	//二维数组
	int b[3][5] = {
		{1, 2, 3, 4, 5},
		{6, 7, 8, 9, 0},
		{11, 22, 33, 44, 55}};
	printf("%d,%d,%d\n", b[0][2], b[1][1], b[2][4]);
	printf("…………………………\n");
	//字符数组
	char c1[] = {'l', 'o', 'v', 'e'};
	//4个元素，char类型为1字节，所以为4个字节
	char c2[] = "LOVE";
	//5个元素，有个\0，5个字节
	char c3[][4] = {
		{'a', 'b', 'c', 'd'},
		{'e', 'f', 'g', 'h'}

	};
	char c4[][3] = {"hel", "Wor"};

	printf("%c\n", c1[2]);
	printf("%c\n", c2[2]);
	printf("%c\n", c3[1][1]);
	printf("%c\n", c4[1][1]);

	char c5[2][4] = {"helu", "loy"}; //注意留'\0'
	printf("%s\n", c5);

	char c6[2][2];
	printf("请输入\n");
	scanf("%s", c6);
	printf("%s", c6);
	//超过4元素会内存泄露
	return 0;
}